In [1]:
import pandas as pd
import numpy as np

In [2]:
import seaborn as sns

df = sns.load_dataset('iris')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
df['c'] = np.select(
[
    (df['sepal_length'].isnull() | (df['petal_length'] > 0))
], 
[
    1
], 
default=0 )
df.head()

   sepal_length  sepal_width  petal_length  petal_width species  c
0           5.1          3.5           1.4          0.2  setosa  1
1           4.9          3.0           1.4          0.2  setosa  1
2           4.7          3.2           1.3          0.2  setosa  1
3           4.6          3.1           1.5          0.2  setosa  1
4           5.0          3.6           1.4          0.2  setosa  1

In [ ]:
# with text, same column
df['c'] = np.select(
[
    (df['species'] == 'setosa')
], 
[
    'target'
], 
    'name' )
df.head()
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species     c
145           6.7          3.0           5.2          2.3  virginica  name
146           6.3          2.5           5.0          1.9  virginica  name
147           6.5          3.0           5.2          2.0  virginica  name
148           6.2          3.4           5.4          2.3  virginica  name
149           5.9          3.0           5.1          1.8  virginica  name

In [4]:
# If the row value in column 'is_blue' is 1 
# Change the row value to 'Yes' 
# otherwise change it to 'No'
df['is_blue'] = df['is_blue'].apply(lambda x: 'Yes' if (x == 1) else 'No')

KeyError: ignored

In [5]:
# or you can use np.where
df['high septal width'] = np.where(df['sepal_width'] > 3, 'Yes', 'No')
df.head()

   sepal_length  sepal_width  petal_length  ...  species  c  high septal width
0           5.1          3.5           1.4  ...   setosa  1                Yes
1           4.9          3.0           1.4  ...   setosa  1                 No
2           4.7          3.2           1.3  ...   setosa  1                Yes
3           4.6          3.1           1.5  ...   setosa  1                Yes
4           5.0          3.6           1.4  ...   setosa  1                Yes

[5 rows x 7 columns]

In [6]:
df2 = pd.DataFrame({'Date' : ['11/8/2011', '11/9/2011', '11/10/2011',
                                        '11/11/2011', '11/12/2011'],
                'Event' : ['Dance', 'Painting', 'Dance', 'Dance', 'Painting']})

df2

         Date     Event
0   11/8/2011     Dance
1   11/9/2011  Painting
2  11/10/2011     Dance
3  11/11/2011     Dance
4  11/12/2011  Painting

In [7]:
df2.loc[(df2.Event == 'Dance'),'Event']='Hip-Hop'
df2

         Date     Event
0   11/8/2011   Hip-Hop
1   11/9/2011  Painting
2  11/10/2011   Hip-Hop
3  11/11/2011   Hip-Hop
4  11/12/2011  Painting

In [8]:
df2['Event'] = np.where((df2.Event == 'Painting'),'Art',df2.Event)
df2

         Date    Event
0   11/8/2011  Hip-Hop
1   11/9/2011      Art
2  11/10/2011  Hip-Hop
3  11/11/2011  Hip-Hop
4  11/12/2011      Art

In [10]:
df2['Event'].mask(df2['Event'] == 'Hip-Hop', 'Jazz', inplace=True)
df2

         Date Event
0   11/8/2011  Jazz
1   11/9/2011   Art
2  11/10/2011  Jazz
3  11/11/2011  Jazz
4  11/12/2011   Art

In [12]:
m = df2.Event == 'Art'
df2.where(~m,other='Theater')
df2

         Date Event
0   11/8/2011  Jazz
1   11/9/2011   Art
2  11/10/2011  Jazz
3  11/11/2011  Jazz
4  11/12/2011   Art